/*1.設計一程式，運用陣列、迴圈及亂數來排列出數字範圍為1~9且為3*3的數字矩陣，其縱向、橫向、對角線之3個數字總和皆為15，每次執行之矩陣排列皆不相同，並於命令列示出該矩陣之數字排列
2.矩陣內之數字皆不能重覆出現
3.矩陣每次執行縱向、橫向、對角線之總和皆為15*/
public class JVD104_4 {
	public static void main(String[] args) {
		//1.建立二維陣列
		int a[][] = new int[3][3];
		int num;
		//a[1][1] = 5;
		while (!(a[0][0] + a[0][1] + a[0][2] == 15
				&& a[1][0] + a[1][1] + a[1][2] == 15
				&& a[2][0] + a[2][1] + a[2][2] == 15
				&& a[0][0] + a[1][0] + a[2][0] == 15
				&& a[0][1] + a[1][1] + a[2][1] == 15
				&& a[0][2] + a[1][2] + a[2][2] == 15
				&& a[0][0] + a[1][1] + a[2][2] == 15 && a[0][2] + a[1][1]
				+ a[2][0] == 15)) {
			for (int i = 0; i <= 3; i++) {
				num = (int) (Math.random() * 9) + 1;
				int j = 0;
				while (j <= 4) {
					if (a[j / 3][j % 3] == num) {
						num = (int) (Math.random() * 9) + 1;
						j = 0;
					} else {
						j++;
					}
				}
				a[i / 3][i % 3] = num;
				a[(8 - i) / 3][(8 - i) % 3] = 15 - a[1][1] - a[i / 3][i % 3];
			}
		}
		for (int x = 0; x < 3; x++) {
			for (int y = 0; y < 3; y++) {
				System.out.print(a[x][y] + " ");
			}
			System.out.println();
		}
	}
}